EDT/УТ/src/DataProcessors/ОтменаЗаказов/ОтменаЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОтменаЗаказов</name>
  <attributes>
    <name>СписокЗаказов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СелекторТипаНомера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторСостояния</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаПереноса</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>МассоваяОперация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

EDT/УТ/src/Catalogs/ПричиныОтказаПереноса/ПричиныОтказаПереноса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПричиныОтказаПереноса</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Брак</name>
      <description>Брак</description>
    </items>
    <items>
      <name>КлиентаНетНаМесте</name>
      <description>Клиента нет на месте</description>
    </items>
    <items>
      <name>НеДозвонилисьДоКлиента</name>
      <description>Не дозвонились до клиента</description>
    </items>
    <items>
      <name>НеТотТовар</name>
      <description>Не тот товар</description>
    </items>
    <items>
      <name>НеУспелиПоВремени</name>
      <description>Не успели по времени</description>
    </items>
    <items>
      <name>ОтказКлиента</name>
      <description>Отказ клиента</description>
    </items>
    <items>
      <name>ПереносЗаказовВСвязиСПревышениемЛимита</name>
      <description>Перенос заказов в связи с превышением лимита</description>
    </items>
    <items>
      <name>ПоПисьмуМагазина</name>
      <description>По письму магазина</description>
    </items>
    <items>
      <name>ПоПросьбеКлиента</name>
      <description>По просьбе клиента</description>
    </items>
  </predefined>
  <attributes>
    <name>СторонаПретензии</name>
    <type>
      <types>EnumRef.СторонаПретензий</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораВМП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораЛогистом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребоватьВводНовогоАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребоватьСменуИнтервала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Забор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторСостояния</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораВАдминке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораПриГрупповойОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступностьПоПричинамНеВыполненияЗаказа</name>
    <attributes>
      <name>ПричинаНевыполнения</name>
      <type>
        <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Доступность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/DataProcessors/ОтменаЗаказов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СелекторТипаНомераПриИзменении(Элемент)
	
	ПоНомеруСтриж = Объект.СелекторТипаНомера = 1;
	
	Если ПоНомеруСтриж Тогда
		Элементы.Партнер.ТолькоПросмотр = Истина;
		Объект.Партнер = Неопределено;
	Иначе
		Элементы.Партнер.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.СелекторТипаНомера = 1;
	//Асеев 25.01.2022 (Задача № 4975)>>>
	Объект.ПричинаОтказаПереноса = Справочники.ПричиныОтказаПереноса.НайтиПоКоду("00000000004");
	//Асеев 25.01.2022 (Задача № 4975)<<<
	
	Элементы.МассоваяОперация.Доступность = РольДоступна("МассоваяГрупповаяОперация");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	Если Объект.СелекторТипаНомера = 2 И Объект.Партнер.Пустая() Тогда
		ПоказатьПредупреждение(, "Укажите партнера");
		Возврат;
	КонецЕсли;
	
	Если Объект.ИнициаторСостояния.Пустая() Тогда
		ПоказатьПредупреждение(, "Укажите инициатора состояния");
		Возврат;
	КонецЕсли;
	
	Если Объект.ПричинаОтказаПереноса.Пустая() Тогда
		ПоказатьПредупреждение(, "Укажите причину отказа переноса");
		Возврат;
	КонецЕсли;
	
	Фиксация = ОтменитьЗаказыНаСервере();
	Если Фиксация <> Неопределено Тогда
		ОткрытьЗначение(Фиксация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтменитьЗаказыНаСервере()
	
	ПоНомеруСтриж = Объект.СелекторТипаНомера = 1;
	
	КоличествоСтрок = СтрЧислоСтрок(Объект.СписокЗаказов);
	
	ТаблицаНомеров = Новый ТаблицаЗначений;
	КолонкиТаблицы = ТаблицаНомеров.Колонки;
	
	Если ПоНомеруСтриж Тогда
		КолонкиТаблицы.Добавить("Номер", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(11));
	Иначе
		КолонкиТаблицы.Добавить("Номер", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50));
	КонецЕсли;

	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		НомерЗаказа = СокрЛП(СтрПолучитьСтроку(Объект.СписокЗаказов, НомерСтроки));
		Если НомерСтроки <> "" Тогда
			СтрокаТаблицы = ТаблицаНомеров.Добавить();
			СтрокаТаблицы.Номер = НомерЗаказа;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ТаблицаНомеров.Количество() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ОтменитьЗаказы(ТаблицаНомеров);
	
КонецФункции
